// categories.js

var categories = {
    "cpu": {
        "id": "1",
        "11": {
            "name": "Intel",
            "children": {
                "111": "十二代",
                "112": "十三代",
                "113": "十四代"
            }
        },
        "12": {
            "name": "AMD",
            "children": {
                "121": "5000系",
                "122": "7000系",
                "123": "9000系"
            }
        }
    },
    "显卡": {
        "id": "2",
        "21": {
            "name": "NVIDIA",
            "children": {
                "211": "10系",
                "212": "20系",
                "213": "30系",
                "214": "40系"
            }
        },
        "22": {
            "name": "AMD",
            "children": {
                "221": "5000系",
                "222": "6000系",
                "223": "7000系"
            }
        }
    },
    "散热": {
        "id": "3",
        "31": {
            "name": "风冷",
            "children": {
                "311": "单塔",
                "312": "双塔"
            }
        },
        "32": {
            "name": "水冷",
            "children": {
                "321": "120",
                "322": "240",
                "323": "360"
            }
        }
    },
    "主板": {
        "id": "4",
        "41": {
            "name": "D4",
            "children": {
                "411": "入门级",
                "412": "中端级",
                "413": "高端定制级"
            }
        },
        "42": {
            "name": "D5",
            "children": {
                "421": "入门级",
                "422": "中端级",
                "423": "高端定制级"
            }
        },
    },
    "电源": {
        "id": "5",
        "51": {
            "name": "全模组",
            "children": {
                "511": "金牌",
                "512": "铜牌"
            }
        },
        "52": {
            "name": "非全模组",
            "children": {
                "521": "金牌",
                "522": "铜牌"
            }
        }
    },
    "内存": {
        "id": "6",
        "61": {
            "name": "DDR4",
            "children": {
                "611": "特调颗粒",
                "612": "非特调颗粒"
            }
        },
        "62": {
            "name": "DDR5",
            "children": {
                "621": "特调颗粒",
                "622": "非特调颗粒"
            }
        }
    },
    "固态": {
        "id": "7",
        "71": {
            "name": "PICE4.0",
            "children": {
                "711": "精选颗粒",
                "712": "非精选颗粒"
            }
        },
        "72": {
            "name": "PICE3.0",
            "children": {
                "721": "精选颗粒",
                "722": "非精选颗粒"
            }
        }
    },
    "机箱": {
        "id": "8",
        "81": {
            "name": "普通机箱",
            "children": {
                "811": "海景房",
                "812": "非海景房"
            }
        },
        "82": {
            "name": "高端定制",
            "children": {
                "821": "海景房",
                "822": "非海景房"
            }
        }
    }
};
