var ancestorCategories = {
    "cpu": {
        "id": "1",
        "name": "CPU"
    },
    "显卡": {
        "id": "2",
        "name": "显卡"
    },
    "散热": {
        "id": "3",
        "name": "散热"
    },
    "主板": {
        "id": "4",
        "name": "主板"
    },
    "电源": {
        "id": "5",
        "name": "电源"
    },
    "内存": {
        "id": "6",
        "name": "内存"
    },
    "固态": {
        "id": "7",
        "name": "固态硬盘"
    },
    "机箱": {
        "id": "8",
        "name": "机箱"
    }
};
